[{"model": "webpages.articles", "pk": 1, "fields": {"name": "TRANSFER FUNCTION REPRESENTATION", "title1": "TRANSFER FUNCTION REPRESENTATION", "quickintro": "Block diagrams consist of a single block or a combination of blocks. These are used to represent the control systems in pictorial form. The basic elements of a block diagram are a block, the summing point and the take-off point.", "intro": "Block diagrams consist of a single block or a combination of blocks. These are used to represent the control systems in pictorial form. The basic elements of a block diagram are a block, the summing point and the take-off point. Let us consider the block diagram of a closed loop control system as shown in the following figure to identify these elements.", "body1": "The transfer function of a component is represented by a block. Block has single input and \r\nsingle output. Summing Point.\r\nThe summing point is represented with a circle having cross (X) inside it. It has two or more inputs and single output. It produces the algebraic sum of the inputs. It also performs the \r\nsummation or subtraction or combination of summation and subtraction of the inputs based on the polarity of the inputs. Let us see these three operations one by one", "title2": "Block Diagrams", "body2": "The above block diagram consists of two blocks having transfer functions G(s) and H(s). It is also having one summing point and one take-off point. Arrows indicate the direction of the flow of signals. Let us now discuss these elements one by one.", "conc": "Block diagram algebra is nothing but the algebra involved with the basic elements of the block diagram. This algebra deals with the pictorial representation of algebraic equations.", "date_posted": "2023-09-29"}}, {"model": "webpages.articles", "pk": 2, "fields": {"name": "Logic Gates", "title1": "Logic Gates", "quickintro": "A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function", "intro": "A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function", "body1": 